Repository: DavitAsatryan/next_generation_armenia
Catalog: lib/l10n/app_*.arb
Languages: am

source: Teachers
am: Ուսուցիչներ

source: Donors
am: Դոնորներ

source: About us
am: Մեր մասին

source: Contact us
am: Կապվեք մեզ հետ

source: blog
am: բլոգ

source: Sign Up
am: Գրանցվել

source: Sign In
am: Մուտք գործել

source: It’s quick and easy.
am: Դա արագ և հեշտ է.

source: Name
am: Անուն

source: Last Name
am: Ազգանուն

source: Email
am: էլփոստի հասցեն

source: Region
am: Տարածաշրջան

source: City, Village
am: Քաղաք, գյուղ

source: School
am: դպրոց

source: Subject
am: Թեմա

source: grade
am: գնահատական

source: Password
am: Գաղտնաբառ

source: Confirm Password
am: Հաստատեք գաղտնաբառը

source: Register as a Donor
am: Գրանցվեք որպես դոնոր

source: Register as a Teacher
am: Գրանցվեք որպես Դասատու

source: Register as a
am: Գրանցվել որպես

source: Forgot Password?
am: Մոռացե՞լ ես գաղտնաբառը

source: New Password
am: Նոր գաղտնաբառ

source: Ok
am: Առաջ

source: Resend code
am: Նորից ուղարկել կոդը

# done
source: Отправить
am: կատարված է

source: Last Name is required
am: Ազգանունը պարտադիր է

source: Email is not correct
am: Email-ը ճիշտ չէ

source: Phone number is not correct
am: Հեռախոսահամարը ճիշտ չ

source: Region is required
am: Տարածաշրջանը պարտադիր է

source: City, Village is required
am: Քաղաք, գյուղ պարտադիր է

source: School is required
am: Դպրոցը պարտադիր է

source: Grade is required
am: Գնահատականը պարտադիր է

source: Password is too short
am: Գաղտնաբառը չափազանց կարճ է

# passwords_ddont_match
source: Passwords don't match
am: Գաղտնաբառերը չեն համընկնում

source: Name is required
am: Անունը պարտադիր է

source: Subject is required
am: Առարկան պարտադիր է

source: Recovery code
am: Վերականգնման կոդ

source: Send
am: Ուղարկել

source: Country
am: Երկիր

source: Welcome Back!
am: Բարի գալուստ

source: City
am: Քաղաք

source: Region/State
am: Տարածաշրջան/նահանգ

source: Recover Password
am: Վերականգնել գաղտնաբառը

# please_enter_your_email
source: Please enter your email to receive a recovery code
am: Խնդրում ենք մուտքագրել ձեր էլ․ հասցեն՝ վերականգնման կոդը ստանալու համար

source: field is required
am: դաշտը պարտադիր է

source: input error text here
am: սխալի տեքստ

source: invalid email
am: անվավեր էլփոստի հասցե

source: invalid filed
am: անվավեր դաշտ

source: passwords doesnt match
am: գաղտնաբառերը չեն համընկնում

source: invalid phone number
am: անվավեր հեռախոսահամար
